app/views/retailer/bus/busbook.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bus="http://192.168.0.131/TT/BusBookingAPI">
   <soap:Header>
      <bus:AuthenticationData>
         <!--Optional:-->
         <bus:SiteName></bus:SiteName>
         <!--Optional:-->
         <bus:AccountCode></bus:AccountCode>
         <!--Optional:-->
         <bus:UserName>appan</bus:UserName>
         <!--Optional:-->
         <bus:Password>appan@1234</bus:Password>
      </bus:AuthenticationData>
   </soap:Header>
   <soap:Body>
      <bus:Book>
         <!--Optional:-->
         <bus:wsBookRequest>
            <bus:ProductTypeId>0</bus:ProductTypeId>
            <bus:ProductId>0</bus:ProductId>
            <bus:BookingMode>online</bus:BookingMode>
            <bus:ProductType>Bus</bus:ProductType>
            <bus:BusId>0</bus:BusId>
            <!--Optional:-->
            <bus:SourceId>109</bus:SourceId>
            <!--Optional:-->
            <bus:DestinationId>1839</bus:DestinationId>
            <!--Optional:-->
            <bus:SourceName>Coimbatore</bus:SourceName>
            <!--Optional:-->
            <bus:DestinationName>Salem</bus:DestinationName>
            <bus:DateOfJourney>2015-09-09</bus:DateOfJourney>
            <bus:BusSource>RedBus</bus:BusSource>
            <bus:IsDomestic>1</bus:IsDomestic>
            <!--Optional:-->
            <bus:RouteId>100041517120436170</bus:RouteId>
            <!--Optional:-->
            <bus:BusType>Volvo A/C Multi Axle Semi Sleeper (2+2)</bus:BusType>
            <!--Optional:-->
            <bus:TravelName>Parveen  Travels</bus:TravelName>
            <bus:NoOfSeats>1</bus:NoOfSeats>
            <bus:DepartureTime>2015-09-09T21:45:00</bus:DepartureTime>
            <bus:ArrivalTime>2015-09-09T23:59:00</bus:ArrivalTime>
            <bus:TotalFare>316.80</bus:TotalFare>
            <!--Optional:-->
            <bus:BoardingPointdetails>
               <bus:CityPointId>835595</bus:CityPointId>
               <bus:BusId>0</bus:BusId>
               <!--Optional:-->
               <bus:CityPointName>Coimbatore Omni Bus Stand</bus:CityPointName>
               <!--Optional:-->
               <bus:CityPointLocation>Coimbatore Omni Bus Stand</bus:CityPointLocation>
               <!--Optional:-->
               <bus:CityPointLandmark></bus:CityPointLandmark>
               <!--Optional:-->
               <bus:CityPointAddress></bus:CityPointAddress>
               <!--Optional:-->
               <bus:CityPointContactNumber></bus:CityPointContactNumber>
               <bus:CityPointTime></bus:CityPointTime>
            </bus:BoardingPointdetails>
            <!--Optional:-->
            <bus:CancelPolicy>
               <!--Zero or more repetitions:-->
               <bus:WSCancellationPolicies>
                  <bus:BusId>?</bus:BusId>
                  <!--Optional:-->
                  <bus:TimeBeforeDept>?</bus:TimeBeforeDept>
                  <bus:CancellationChargeType>?</bus:CancellationChargeType>
                  <bus:CancellationCharge>?</bus:CancellationCharge>
               </bus:WSCancellationPolicies>
            </bus:CancelPolicy>
            <!--Optional:-->
            <bus:PaxDetail>
               <bus:BusId>?</bus:BusId>
               <bus:PaxId>?</bus:PaxId>
               <!--Optional:-->
               <bus:Title>?</bus:Title>
               <!--Optional:-->
               <bus:LastName>?</bus:LastName>
               <!--Optional:-->
               <bus:FirstName>?</bus:FirstName>
               <bus:Age>?</bus:Age>
               <!--Optional:-->
               <bus:PhoneNo>?</bus:PhoneNo>
               <!--Optional:-->
               <bus:EMail>?</bus:EMail>
               <!--Optional:-->
               <bus:Address>?</bus:Address>
               <bus:Gender>?</bus:Gender>
            </bus:PaxDetail>
            <!--Optional:-->
            <bus:SeatsDetail>
               <!--Zero or more repetitions:-->
               <bus:WSBusSeatDetail>
                  <bus:SeatId>?</bus:SeatId>
                  <bus:BusId>?</bus:BusId>
                  <!--Optional:-->
                  <bus:SeatName>?</bus:SeatName>
                  <bus:SeatType>?</bus:SeatType>
                  <!--Optional:-->
                  <bus:RowNo>?</bus:RowNo>
                  <!--Optional:-->
                  <bus:ColumnNo>?</bus:ColumnNo>
                  <bus:SeatStatus>?</bus:SeatStatus>
                  <bus:SeatFare>?</bus:SeatFare>
                  <bus:priceId>?</bus:priceId>
                  <bus:Width>?</bus:Width>
                  <bus:Height>?</bus:Height>
                  <bus:IsLadies>?</bus:IsLadies>
                  <bus:IsUpper>?</bus:IsUpper>
                  <!--Optional:-->
                  <bus:Price>
                     <bus:TdsCommission>?</bus:TdsCommission>
                     <bus:PriceId>?</bus:PriceId>
                     <bus:PublishedFare>?</bus:PublishedFare>
                     <bus:AgentCommission>?</bus:AgentCommission>
                     <bus:SeviceTax>?</bus:SeviceTax>
                     <bus:Tax>?</bus:Tax>
                     <!--Optional:-->
                     <bus:Currency>?</bus:Currency>
                     <bus:RateOfExchange>?</bus:RateOfExchange>
                     <!--Optional:-->
                     <bus:CurrencyCode>?</bus:CurrencyCode>
                     <bus:Discount>?</bus:Discount>
                     <bus:TdsRate>?</bus:TdsRate>
                  </bus:Price>
               </bus:WSBusSeatDetail>
            </bus:SeatsDetail>
            <!--Optional:-->
            <bus:Currency>?</bus:Currency>
            <!--Optional:-->
            <bus:SessionId>?</bus:SessionId>
         </bus:wsBookRequest>
      </bus:Book>
   </soap:Body>
</soap:Envelope>